---
kind: enumMember
id: F:Autodesk.Revit.DB.PropOverrideMode.NewLayer
enum: Autodesk.Revit.DB.PropOverrideMode
source: html/8d32fcba-032e-fd21-2b94-f115733fcbaa.htm
---
# Autodesk.Revit.DB.PropOverrideMode.NewLayer

All properties BYLAYER, New Layers for overrides.
 Visual fidelity is preserved and there is by-layer control over all entities,
 although number of layers in the exported file might be increased.